Revit 2027 API
DimensionType.GetAlternateUnitsFormatOptions Method
 Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetAlternateUnitsFormatOptions()
Public Function GetAlternateUnitsFormatOptions As FormatOptions
public:
FormatOptions^ GetAlternateUnitsFormatOptions()
member GetAlternateUnitsFormatOptions : unit -> FormatOptions
Return Value
FormatOptions
 A copy of the FormatOptions.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace